---
kind: property
id: P:Autodesk.Revit.DB.Visual.Metal.MetalPattern
source: html/25c4371c-6919-033b-05ea-afd04414f6bd.htm
---
# Autodesk.Revit.DB.Visual.Metal.MetalPattern Property

The property labeled "Relief Pattern" from the "Metal" schema.

## Syntax (C#)
```csharp
public static string MetalPattern { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetalPatternType".